perf/day67/k6_after.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: load-test/k6-baseline.js
        output: -

     scenarios: (100.00%) 2 scenarios, 205 max VUs, 3m0s max duration (incl. graceful stop):
              * warmup: 5 looping VUs for 30s (gracefulStop: 5s)
              * baseline: 50.00 iterations/s for 2m0s (maxVUs: 50-200, startTime: 30s, gracefulStop: 30s)


running (0m01.0s), 005/055 VUs, 41 complete and 0 interrupted iterations
warmup     [   3% ] 5 VUs    01.0s/30s
baseline • [   0% ] waiting  29.0s

running (0m02.0s), 005/055 VUs, 91 complete and 0 interrupted iterations
warmup     [   7% ] 5 VUs    02.0s/30s
baseline • [   0% ] waiting  28.0s

running (0m03.0s), 005/055 VUs, 136 complete and 0 interrupted iterations
warmup     [  10% ] 5 VUs    03.0s/30s
baseline • [   0% ] waiting  27.0s

running (0m04.0s), 005/055 VUs, 186 complete and 0 interrupted iterations
warmup     [  13% ] 5 VUs    04.0s/30s
baseline • [   0% ] waiting  26.0s

running (0m05.0s), 005/055 VUs, 233 complete and 0 interrupted iterations
warmup     [  17% ] 5 VUs    05.0s/30s
baseline • [   0% ] waiting  25.0s

running (0m06.0s), 005/055 VUs, 272 complete and 0 interrupted iterations
warmup     [  20% ] 5 VUs    06.0s/30s
baseline • [   0% ] waiting  24.0s

running (0m07.0s), 005/055 VUs, 321 complete and 0 interrupted iterations
warmup     [  23% ] 5 VUs    07.0s/30s
baseline • [   0% ] waiting  23.0s

running (0m08.0s), 005/055 VUs, 368 complete and 0 interrupted iterations
warmup     [  27% ] 5 VUs    08.0s/30s
baseline • [   0% ] waiting  22.0s

running (0m09.0s), 005/055 VUs, 418 complete and 0 interrupted iterations
warmup     [  30% ] 5 VUs    09.0s/30s
baseline • [   0% ] waiting  21.0s

running (0m10.0s), 005/055 VUs, 466 complete and 0 interrupted iterations
warmup     [  33% ] 5 VUs    10.0s/30s
baseline • [   0% ] waiting  20.0s

running (0m11.0s), 005/055 VUs, 515 complete and 0 interrupted iterations
warmup     [  37% ] 5 VUs    11.0s/30s
baseline • [   0% ] waiting  19.0s

running (0m12.0s), 005/055 VUs, 561 complete and 0 interrupted iterations
warmup     [  40% ] 5 VUs    12.0s/30s
baseline • [   0% ] waiting  18.0s

running (0m13.0s), 005/055 VUs, 611 complete and 0 interrupted iterations
warmup     [  43% ] 5 VUs    13.0s/30s
baseline • [   0% ] waiting  17.0s

running (0m14.0s), 005/055 VUs, 659 complete and 0 interrupted iterations
warmup     [  47% ] 5 VUs    14.0s/30s
baseline • [   0% ] waiting  16.0s

running (0m15.0s), 005/055 VUs, 706 complete and 0 interrupted iterations
warmup     [  50% ] 5 VUs    15.0s/30s
baseline • [   0% ] waiting  15.0s

running (0m16.0s), 005/055 VUs, 755 complete and 0 interrupted iterations
warmup     [  53% ] 5 VUs    16.0s/30s
baseline • [   0% ] waiting  14.0s

running (0m17.0s), 005/055 VUs, 801 complete and 0 interrupted iterations
warmup     [  57% ] 5 VUs    17.0s/30s
baseline • [   0% ] waiting  13.0s

running (0m18.0s), 005/055 VUs, 851 complete and 0 interrupted iterations
warmup     [  60% ] 5 VUs    18.0s/30s
baseline • [   0% ] waiting  12.0s

running (0m19.0s), 005/055 VUs, 897 complete and 0 interrupted iterations
warmup     [  63% ] 5 VUs    19.0s/30s
baseline • [   0% ] waiting  11.0s

running (0m20.0s), 005/055 VUs, 946 complete and 0 interrupted iterations
warmup     [  67% ] 5 VUs    20.0s/30s
baseline • [   0% ] waiting  10.0s

running (0m21.0s), 005/055 VUs, 993 complete and 0 interrupted iterations
warmup     [  70% ] 5 VUs    21.0s/30s
baseline • [   0% ] waiting  09.0s

running (0m22.0s), 005/055 VUs, 1041 complete and 0 interrupted iterations
warmup     [  73% ] 5 VUs    22.0s/30s
baseline • [   0% ] waiting  08.0s

running (0m23.0s), 005/055 VUs, 1089 complete and 0 interrupted iterations
warmup     [  77% ] 5 VUs    23.0s/30s
baseline • [   0% ] waiting  07.0s

running (0m24.0s), 005/055 VUs, 1136 complete and 0 interrupted iterations
warmup     [  80% ] 5 VUs    24.0s/30s
baseline • [   0% ] waiting  06.0s

running (0m25.0s), 005/055 VUs, 1186 complete and 0 interrupted iterations
warmup     [  83% ] 5 VUs    25.0s/30s
baseline • [   0% ] waiting  05.0s

running (0m26.0s), 005/055 VUs, 1231 complete and 0 interrupted iterations
warmup     [  87% ] 5 VUs    26.0s/30s
baseline • [   0% ] waiting  04.0s

running (0m27.0s), 005/055 VUs, 1281 complete and 0 interrupted iterations
warmup     [  90% ] 5 VUs    27.0s/30s
baseline • [   0% ] waiting  03.0s

running (0m28.0s), 005/055 VUs, 1326 complete and 0 interrupted iterations
warmup     [  93% ] 5 VUs    28.0s/30s
baseline • [   0% ] waiting  02.0s

running (0m29.0s), 005/055 VUs, 1376 complete and 0 interrupted iterations
warmup     [  97% ] 5 VUs    29.0s/30s
baseline • [   0% ] waiting  01.0s

running (0m30.0s), 005/055 VUs, 1422 complete and 0 interrupted iterations
warmup     [ 100% ] 5 VUs    30.0s/30s
baseline • [   0% ] waiting  00.0s

running (0m31.0s), 005/055 VUs, 1472 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [   1% ] 005/050 VUs  0m01.0s/2m0s  50.00 iters/s

running (0m32.0s), 006/055 VUs, 1521 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [   2% ] 006/050 VUs  0m02.0s/2m0s  50.00 iters/s

running (0m33.0s), 006/055 VUs, 1571 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [   2% ] 006/050 VUs  0m03.0s/2m0s  50.00 iters/s

running (0m34.0s), 006/055 VUs, 1621 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [   3% ] 006/050 VUs  0m04.0s/2m0s  50.00 iters/s

running (0m35.0s), 006/055 VUs, 1671 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [   4% ] 006/050 VUs  0m05.0s/2m0s  50.00 iters/s

running (0m36.0s), 006/055 VUs, 1721 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [   5% ] 006/050 VUs  0m06.0s/2m0s  50.00 iters/s

running (0m37.0s), 006/055 VUs, 1771 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [   6% ] 006/050 VUs  0m07.0s/2m0s  50.00 iters/s

running (0m38.0s), 005/055 VUs, 1822 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [   7% ] 005/050 VUs  0m08.0s/2m0s  50.00 iters/s

running (0m39.0s), 006/055 VUs, 1871 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [   7% ] 006/050 VUs  0m09.0s/2m0s  50.00 iters/s

running (0m40.0s), 006/055 VUs, 1921 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [   8% ] 006/050 VUs  0m10.0s/2m0s  50.00 iters/s

running (0m41.0s), 006/055 VUs, 1971 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [   9% ] 006/050 VUs  0m11.0s/2m0s  50.00 iters/s

running (0m42.0s), 006/055 VUs, 2021 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  10% ] 006/050 VUs  0m12.0s/2m0s  50.00 iters/s

running (0m43.0s), 006/055 VUs, 2071 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  11% ] 006/050 VUs  0m13.0s/2m0s  50.00 iters/s

running (0m44.0s), 006/055 VUs, 2121 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  12% ] 006/050 VUs  0m14.0s/2m0s  50.00 iters/s

running (0m45.0s), 005/055 VUs, 2172 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  12% ] 005/050 VUs  0m15.0s/2m0s  50.00 iters/s

running (0m46.0s), 005/055 VUs, 2222 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  13% ] 005/050 VUs  0m16.0s/2m0s  50.00 iters/s

running (0m47.0s), 005/055 VUs, 2272 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  14% ] 005/050 VUs  0m17.0s/2m0s  50.00 iters/s

running (0m48.0s), 005/055 VUs, 2322 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  15% ] 005/050 VUs  0m18.0s/2m0s  50.00 iters/s

running (0m49.0s), 005/055 VUs, 2372 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  16% ] 005/050 VUs  0m19.0s/2m0s  50.00 iters/s

running (0m50.0s), 006/055 VUs, 2421 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  17% ] 006/050 VUs  0m20.0s/2m0s  50.00 iters/s

running (0m51.0s), 005/055 VUs, 2472 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  17% ] 005/050 VUs  0m21.0s/2m0s  50.00 iters/s

running (0m52.0s), 006/055 VUs, 2521 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  18% ] 006/050 VUs  0m22.0s/2m0s  50.00 iters/s

running (0m53.0s), 005/055 VUs, 2572 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  19% ] 005/050 VUs  0m23.0s/2m0s  50.00 iters/s

running (0m54.0s), 006/055 VUs, 2621 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  20% ] 006/050 VUs  0m24.0s/2m0s  50.00 iters/s

running (0m55.0s), 006/055 VUs, 2671 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  21% ] 006/050 VUs  0m25.0s/2m0s  50.00 iters/s

running (0m56.0s), 005/055 VUs, 2722 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  22% ] 005/050 VUs  0m26.0s/2m0s  50.00 iters/s

running (0m57.0s), 005/055 VUs, 2772 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  22% ] 005/050 VUs  0m27.0s/2m0s  50.00 iters/s

running (0m58.0s), 006/055 VUs, 2821 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  23% ] 006/050 VUs  0m28.0s/2m0s  50.00 iters/s

running (0m59.0s), 005/055 VUs, 2872 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  24% ] 005/050 VUs  0m29.0s/2m0s  50.00 iters/s

running (1m00.0s), 005/055 VUs, 2922 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  25% ] 005/050 VUs  0m30.0s/2m0s  50.00 iters/s

running (1m01.0s), 005/055 VUs, 2972 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  26% ] 005/050 VUs  0m31.0s/2m0s  50.00 iters/s

running (1m02.0s), 005/055 VUs, 3022 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  27% ] 005/050 VUs  0m32.0s/2m0s  50.00 iters/s

running (1m03.0s), 006/055 VUs, 3071 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  27% ] 006/050 VUs  0m33.0s/2m0s  50.00 iters/s

running (1m04.0s), 005/055 VUs, 3122 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  28% ] 005/050 VUs  0m34.0s/2m0s  50.00 iters/s

running (1m05.0s), 005/055 VUs, 3172 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  29% ] 005/050 VUs  0m35.0s/2m0s  50.00 iters/s

running (1m06.0s), 007/055 VUs, 3220 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  30% ] 007/050 VUs  0m36.0s/2m0s  50.00 iters/s

running (1m07.0s), 005/055 VUs, 3272 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  31% ] 005/050 VUs  0m37.0s/2m0s  50.00 iters/s

running (1m08.0s), 005/055 VUs, 3322 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  32% ] 005/050 VUs  0m38.0s/2m0s  50.00 iters/s

running (1m09.0s), 005/055 VUs, 3372 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  32% ] 005/050 VUs  0m39.0s/2m0s  50.00 iters/s

running (1m10.0s), 005/055 VUs, 3422 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  33% ] 005/050 VUs  0m40.0s/2m0s  50.00 iters/s

running (1m11.0s), 005/055 VUs, 3472 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  34% ] 005/050 VUs  0m41.0s/2m0s  50.00 iters/s

running (1m12.0s), 005/055 VUs, 3522 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  35% ] 005/050 VUs  0m42.0s/2m0s  50.00 iters/s

running (1m13.0s), 006/055 VUs, 3571 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  36% ] 006/050 VUs  0m43.0s/2m0s  50.00 iters/s

running (1m14.0s), 005/055 VUs, 3622 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  37% ] 005/050 VUs  0m44.0s/2m0s  50.00 iters/s

running (1m15.0s), 005/055 VUs, 3672 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  37% ] 005/050 VUs  0m45.0s/2m0s  50.00 iters/s

running (1m16.0s), 006/055 VUs, 3721 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  38% ] 006/050 VUs  0m46.0s/2m0s  50.00 iters/s

running (1m17.0s), 005/055 VUs, 3772 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  39% ] 005/050 VUs  0m47.0s/2m0s  50.00 iters/s

running (1m18.0s), 005/055 VUs, 3822 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  40% ] 005/050 VUs  0m48.0s/2m0s  50.00 iters/s

running (1m19.0s), 006/055 VUs, 3871 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  41% ] 006/050 VUs  0m49.0s/2m0s  50.00 iters/s

running (1m20.0s), 005/055 VUs, 3922 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  42% ] 005/050 VUs  0m50.0s/2m0s  50.00 iters/s

running (1m21.0s), 005/055 VUs, 3972 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  42% ] 005/050 VUs  0m51.0s/2m0s  50.00 iters/s

running (1m22.0s), 005/055 VUs, 4022 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  43% ] 005/050 VUs  0m52.0s/2m0s  50.00 iters/s

running (1m23.0s), 005/055 VUs, 4072 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  44% ] 005/050 VUs  0m53.0s/2m0s  50.00 iters/s

running (1m24.0s), 006/055 VUs, 4121 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  45% ] 006/050 VUs  0m54.0s/2m0s  50.00 iters/s

running (1m25.0s), 005/055 VUs, 4172 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  46% ] 005/050 VUs  0m55.0s/2m0s  50.00 iters/s

running (1m26.0s), 005/055 VUs, 4222 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  47% ] 005/050 VUs  0m56.0s/2m0s  50.00 iters/s

running (1m27.0s), 006/055 VUs, 4271 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  47% ] 006/050 VUs  0m57.0s/2m0s  50.00 iters/s

running (1m28.0s), 005/055 VUs, 4322 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  48% ] 005/050 VUs  0m58.0s/2m0s  50.00 iters/s

running (1m29.0s), 005/055 VUs, 4372 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  49% ] 005/050 VUs  0m59.0s/2m0s  50.00 iters/s

running (1m30.0s), 006/055 VUs, 4421 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  50% ] 006/050 VUs  1m00.0s/2m0s  50.00 iters/s

running (1m31.0s), 005/055 VUs, 4472 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  51% ] 005/050 VUs  1m01.0s/2m0s  50.00 iters/s

running (1m32.0s), 005/055 VUs, 4522 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  52% ] 005/050 VUs  1m02.0s/2m0s  50.00 iters/s

running (1m33.0s), 005/055 VUs, 4572 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  52% ] 005/050 VUs  1m03.0s/2m0s  50.00 iters/s

running (1m34.0s), 005/055 VUs, 4622 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  53% ] 005/050 VUs  1m04.0s/2m0s  50.00 iters/s

running (1m35.0s), 006/055 VUs, 4671 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  54% ] 006/050 VUs  1m05.0s/2m0s  50.00 iters/s

running (1m36.0s), 005/055 VUs, 4722 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  55% ] 005/050 VUs  1m06.0s/2m0s  50.00 iters/s

running (1m37.0s), 005/055 VUs, 4772 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  56% ] 005/050 VUs  1m07.0s/2m0s  50.00 iters/s

running (1m38.0s), 006/055 VUs, 4821 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  57% ] 006/050 VUs  1m08.0s/2m0s  50.00 iters/s

running (1m39.0s), 005/055 VUs, 4872 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  57% ] 005/050 VUs  1m09.0s/2m0s  50.00 iters/s

running (1m40.0s), 005/055 VUs, 4922 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  58% ] 005/050 VUs  1m10.0s/2m0s  50.00 iters/s

running (1m41.0s), 006/055 VUs, 4971 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  59% ] 006/050 VUs  1m11.0s/2m0s  50.00 iters/s

running (1m42.0s), 006/055 VUs, 5021 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  60% ] 006/050 VUs  1m12.0s/2m0s  50.00 iters/s

running (1m43.0s), 005/055 VUs, 5072 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  61% ] 005/050 VUs  1m13.0s/2m0s  50.00 iters/s

running (1m44.0s), 006/055 VUs, 5121 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  62% ] 006/050 VUs  1m14.0s/2m0s  50.00 iters/s

running (1m45.0s), 005/055 VUs, 5172 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  62% ] 005/050 VUs  1m15.0s/2m0s  50.00 iters/s

running (1m46.0s), 006/055 VUs, 5221 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  63% ] 006/050 VUs  1m16.0s/2m0s  50.00 iters/s

running (1m47.0s), 005/055 VUs, 5272 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  64% ] 005/050 VUs  1m17.0s/2m0s  50.00 iters/s

running (1m48.0s), 006/055 VUs, 5321 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  65% ] 006/050 VUs  1m18.0s/2m0s  50.00 iters/s

running (1m49.0s), 006/055 VUs, 5371 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  66% ] 006/050 VUs  1m19.0s/2m0s  50.00 iters/s

running (1m50.0s), 005/055 VUs, 5422 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  67% ] 005/050 VUs  1m20.0s/2m0s  50.00 iters/s

running (1m51.0s), 005/055 VUs, 5472 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  67% ] 005/050 VUs  1m21.0s/2m0s  50.00 iters/s

running (1m52.0s), 005/055 VUs, 5522 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  68% ] 005/050 VUs  1m22.0s/2m0s  50.00 iters/s

running (1m53.0s), 005/055 VUs, 5572 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  69% ] 005/050 VUs  1m23.0s/2m0s  50.00 iters/s

running (1m54.0s), 006/055 VUs, 5621 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  70% ] 006/050 VUs  1m24.0s/2m0s  50.00 iters/s

running (1m55.0s), 005/055 VUs, 5672 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  71% ] 005/050 VUs  1m25.0s/2m0s  50.00 iters/s

running (1m56.0s), 005/055 VUs, 5722 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  72% ] 005/050 VUs  1m26.0s/2m0s  50.00 iters/s

running (1m57.0s), 006/055 VUs, 5771 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  72% ] 006/050 VUs  1m27.0s/2m0s  50.00 iters/s

running (1m58.0s), 005/055 VUs, 5822 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  73% ] 005/050 VUs  1m28.0s/2m0s  50.00 iters/s

running (1m59.0s), 007/055 VUs, 5870 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  74% ] 007/050 VUs  1m29.0s/2m0s  50.00 iters/s

running (2m00.0s), 006/055 VUs, 5921 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  75% ] 006/050 VUs  1m30.0s/2m0s  50.00 iters/s

running (2m01.0s), 005/055 VUs, 5972 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  76% ] 005/050 VUs  1m31.0s/2m0s  50.00 iters/s

running (2m02.0s), 006/055 VUs, 6021 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  77% ] 006/050 VUs  1m32.0s/2m0s  50.00 iters/s

running (2m03.0s), 005/055 VUs, 6072 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  77% ] 005/050 VUs  1m33.0s/2m0s  50.00 iters/s

running (2m04.0s), 005/055 VUs, 6122 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  78% ] 005/050 VUs  1m34.0s/2m0s  50.00 iters/s

running (2m05.0s), 005/055 VUs, 6172 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  79% ] 005/050 VUs  1m35.0s/2m0s  50.00 iters/s

running (2m06.0s), 005/055 VUs, 6222 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  80% ] 005/050 VUs  1m36.0s/2m0s  50.00 iters/s

running (2m07.0s), 005/055 VUs, 6272 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  81% ] 005/050 VUs  1m37.0s/2m0s  50.00 iters/s

running (2m08.0s), 005/055 VUs, 6322 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  82% ] 005/050 VUs  1m38.0s/2m0s  50.00 iters/s

running (2m09.0s), 006/055 VUs, 6371 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  82% ] 006/050 VUs  1m39.0s/2m0s  50.00 iters/s

running (2m10.0s), 005/055 VUs, 6422 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  83% ] 005/050 VUs  1m40.0s/2m0s  50.00 iters/s

running (2m11.0s), 005/055 VUs, 6472 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  84% ] 005/050 VUs  1m41.0s/2m0s  50.00 iters/s

running (2m12.0s), 006/055 VUs, 6521 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  85% ] 006/050 VUs  1m42.0s/2m0s  50.00 iters/s

running (2m13.0s), 005/055 VUs, 6572 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  86% ] 005/050 VUs  1m43.0s/2m0s  50.00 iters/s

running (2m14.0s), 005/055 VUs, 6622 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  87% ] 005/050 VUs  1m44.0s/2m0s  50.00 iters/s

running (2m15.0s), 005/055 VUs, 6672 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  87% ] 005/050 VUs  1m45.0s/2m0s  50.00 iters/s

running (2m16.0s), 006/055 VUs, 6721 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  88% ] 006/050 VUs  1m46.0s/2m0s  50.00 iters/s

running (2m17.0s), 005/055 VUs, 6772 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  89% ] 005/050 VUs  1m47.0s/2m0s  50.00 iters/s

running (2m18.0s), 006/055 VUs, 6821 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  90% ] 006/050 VUs  1m48.0s/2m0s  50.00 iters/s

running (2m19.0s), 006/055 VUs, 6871 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  91% ] 006/050 VUs  1m49.0s/2m0s  50.00 iters/s

running (2m20.0s), 005/055 VUs, 6922 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  92% ] 005/050 VUs  1m50.0s/2m0s  50.00 iters/s

running (2m21.0s), 005/055 VUs, 6972 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  92% ] 005/050 VUs  1m51.0s/2m0s  50.00 iters/s

running (2m22.0s), 006/055 VUs, 7021 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  93% ] 006/050 VUs  1m52.0s/2m0s  50.00 iters/s

running (2m23.0s), 005/055 VUs, 7072 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  94% ] 005/050 VUs  1m53.0s/2m0s  50.00 iters/s

running (2m24.0s), 006/055 VUs, 7121 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  95% ] 006/050 VUs  1m54.0s/2m0s  50.00 iters/s

running (2m25.0s), 005/055 VUs, 7172 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  96% ] 005/050 VUs  1m55.0s/2m0s  50.00 iters/s

running (2m26.0s), 005/055 VUs, 7222 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  97% ] 005/050 VUs  1m56.0s/2m0s  50.00 iters/s

running (2m27.0s), 006/055 VUs, 7271 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  97% ] 006/050 VUs  1m57.0s/2m0s  50.00 iters/s

running (2m28.0s), 005/055 VUs, 7322 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  98% ] 005/050 VUs  1m58.0s/2m0s  50.00 iters/s

running (2m29.0s), 005/055 VUs, 7372 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [  99% ] 005/050 VUs  1m59.0s/2m0s  50.00 iters/s

running (2m30.0s), 005/055 VUs, 7422 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s          
baseline   [ 100% ] 005/050 VUs  2m00.0s/2m0s  50.00 iters/s


  █ THRESHOLDS 

    http_req_duration{op:read_detail}
    ✓ 'p(95)<500' p(95)=8.93ms

    http_req_duration{op:read_jobs_first}
    ✓ 'p(95)<500' p(95)=0s

    http_req_duration{op:read_jobs_next}
    ✓ 'p(95)<500' p(95)=0s

    http_req_duration{op:read_list_first}
    ✓ 'p(95)<500' p(95)=1.95ms

    http_req_duration{op:read_list_next}
    ✓ 'p(95)<500' p(95)=8.23ms

    http_req_duration{op:read_regs_first}
    ✓ 'p(95)<500' p(95)=0s

    http_req_duration{op:read_regs_next}
    ✓ 'p(95)<500' p(95)=0s

    http_req_failed{op:read_detail}
    ✓ 'rate<0.01' rate=0.00%

    http_req_failed{op:read_jobs_first}
    ✓ 'rate<0.01' rate=0.00%

    http_req_failed{op:read_jobs_next}
    ✓ 'rate<0.01' rate=0.00%

    http_req_failed{op:read_list_first}
    ✓ 'rate<0.01' rate=0.00%

    http_req_failed{op:read_list_next}
    ✓ 'rate<0.01' rate=0.00%

    http_req_failed{op:read_regs_first}
    ✓ 'rate<0.01' rate=0.00%

    http_req_failed{op:read_regs_next}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 13478   89.784818/s
    checks_succeeded...: 100.00% 13478 out of 13478
    checks_failed......: 0.00%   0 out of 13478

    ✓ GET /events (first) 200
    ✓ GET /events (next) 200
    ✓ events next page has items[]
    ✓ GET /events/:id 200

    HTTP
    http_req_duration..............: avg=2.63ms   min=198µs    med=1.78ms   max=172.3ms  p(90)=4.6ms    p(95)=6.39ms  
      { expected_response:true }...: avg=2.63ms   min=198µs    med=1.78ms   max=172.3ms  p(90)=4.6ms    p(95)=6.39ms  
      { op:read_detail }...........: avg=4.26ms   min=776µs    med=3.06ms   max=172.3ms  p(90)=6.45ms   p(95)=8.93ms  
      { op:read_jobs_first }.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
      { op:read_jobs_next }........: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
      { op:read_list_first }.......: avg=1.09ms   min=198µs    med=788µs    max=127.51ms p(90)=1.42ms   p(95)=1.95ms  
      { op:read_list_next }........: avg=3.74ms   min=632µs    med=2.66ms   max=148.85ms p(90)=5.71ms   p(95)=8.23ms  
      { op:read_regs_first }.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
      { op:read_regs_next }........: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
    http_req_failed................: 0.00%  0 out of 9336
      { op:read_detail }...........: 0.00%  0 out of 1052
      { op:read_jobs_first }.......: 0.00%  0 out of 0
      { op:read_jobs_next }........: 0.00%  0 out of 0
      { op:read_list_first }.......: 0.00%  0 out of 4142
      { op:read_list_next }........: 0.00%  0 out of 4142
      { op:read_regs_first }.......: 0.00%  0 out of 0
      { op:read_regs_next }........: 0.00%  0 out of 0
    http_reqs......................: 9336   62.19254/s

    EXECUTION
    iteration_duration.............: avg=104.39ms min=100.06ms med=103.76ms max=276.25ms p(90)=107.97ms p(95)=110.59ms
    iterations.....................: 7428   49.48224/s
    vus............................: 5      min=5         max=7 
    vus_max........................: 55     min=55        max=55

    NETWORK
    data_received..................: 29 MB  191 kB/s
    data_sent......................: 1.3 MB 8.8 kB/s



running (2m30.1s), 000/055 VUs, 7428 complete and 0 interrupted iterations
warmup   ✓ [ 100% ] 5 VUs        30s  
baseline ✓ [ 100% ] 000/050 VUs  2m0s  50.00 iters/s



calls |    total_exec_time    |    mean_exec_time     | rows |                                                query
-------+-----------------------+-----------------------+------+------------------------------------------------------------------------------------------------------
  2267 |     874.6468530000001 |    0.3858168738420818 |    0 | WITH next AS (                                                                                      +
       |                       |                       |      |                         SELECT id                                                                   +
       |                       |                       |      |                         FROM jobs                                                                   +
       |                       |                       |      |                         WHERE status = 'pending'                                                    +
       |                       |                       |      |                           AND run_at <= NOW()                                                       +
       |                       |                       |      |                           AND attempts < max_attempts                                               +
       |                       |                       |      |                         ORDER BY priority DESC, run_at ASC, created_at ASC                          +
       |                       |                       |      |                         FOR UPDATE SKIP LOCKED                                                      +
       |                       |                       |      |                         LIMIT 1                                                                     +
       |                       |                       |      |                 )                                                                                   +
       |                       |                       |      |                 UPDATE jobs                                                                         +
       |                       |                       |      |                 SET status = 'processing',                                                          +
       |                       |                       |      |                     locked_at = NOW(),                                                              +
       |                       |                       |      |                     locked_by = $1,                                                                 +
       |                       |                       |      |                     updated_at = NOW()                                                              +
       |                       |                       |      |                 WHERE id = (SELECT id FROM next)                                                    +
       |                       |                       |      |                 RETURNING id, type, payload, status,                                                +
       |                       |                       |      |                           attempts, max_attempts,                                                   +
       |                       |                       |      |                           run_at, locked_at, locked_by,                                             +
       |                       |                       |      |                           last_error,idempotency_key,priority,user_id, created_at, updated_at
  8219 |     564.2290339999992 |   0.06864935320598607 | 9059 | SELECT id, title, description, city, start_at, capacity, created_at, updated_at                     +
       |                       |                       |      |                 FROM events                                                                         +
       |                       |                       |      |          WHERE (start_at, id) > ($1, $2) ORDER BY start_at ASC, id ASC LIMIT $3
   453 |    247.78928400000012 |    0.5469962119205296 |    0 | UPDATE jobs                                                                                         +
       |                       |                       |      |                 SET status = 'pending',                                                             +
       |                       |                       |      |                     locked_at = NULL,                                                               +
       |                       |                       |      |                     locked_by = NULL,                                                               +
       |                       |                       |      |                     updated_at = NOW()                                                              +
       |                       |                       |      |                 WHERE status = 'processing'                                                         +
       |                       |                       |      |                   AND locked_at IS NOT NULL                                                         +
       |                       |                       |      |                   AND locked_at < NOW() - ($1 * INTERVAL '1 second')
  2206 |    198.48965700000025 |   0.08997717905711702 | 2206 | SELECT id, title, description,city,start_at,capacity,created_at,updated_at FROM events WHERE id =$1
     2 |             27.274915 |            13.6374575 |    2 | INSERT INTO refresh_tokens (id, user_id,token_hash, expires_at, revoked_at, replaced_by, created_at)+
       |                       |                       |      |                 VALUES ($1,$2,$3,$4,$5,$6,$7)
     1 |              2.204458 |              2.204458 |    1 | SELECT pg_stat_statements_reset()
     2 |              1.733333 |             0.8666665 |    2 | SELECT $2 FROM ONLY "public"."users" x WHERE "id" OPERATOR(pg_catalog.=) $1 FOR KEY SHARE OF x
     2 |              0.709792 |              0.354896 |    2 | SELECT id, email, password_hash, name, role, created_at, updated_at                                 +
       |                       |                       |      |          FROM users                                                                                 +
       |                       |                       |      |          WHERE email = $1
     2 |              0.002958 |              0.001479 |    0 | begin
     2 | 0.0019169999999999999 | 0.0009584999999999999 |    0 | commit
(10 rows)